chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx675f512h.h
PLIB_INLINE SFR_TYPE* _USB_EP5_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP5;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP5_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP5;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP5_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP5;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP5_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP5;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP5_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP5;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP6_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP6;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP6_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP6;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP6_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP6;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP6_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP6;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP6_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP6;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP7_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP7;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP7_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP7;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP7_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP7;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP7_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP7;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP7_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP7;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP8_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP8;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP8_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP8;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP8_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP8;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP8_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP8;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP8_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP8;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP9_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP9;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP9_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP9;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP9_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP9;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP9_STALL_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP9;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP9_HANDSHAKE_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP9;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP10_CONTROL_OFF_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP10;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP10_RCV_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP10;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _USB_EP10_XMIT_ON_VREG(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return &U1EP10;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

